def productExceptSelf(nums: list[int]) -> list[int]:
    res = [1] * len(nums)

    # на пути вперёд в первый элемент идёт единица,
    # во второй - первый элемент,
    # в третий - первый * второй,
    # в четвёртый - первый * второй * третий
    # в предпоследний - все кроме последнего и предпоследнего
    # в последний - все кроме последнего
    accum = 1
    for i in range(len(nums)):
        res[i] = accum
        accum *= nums[i]

    # на пути назад, то, что уже посчитали, домножим
    # последний на единицу - там и так правильное произведение
    # предпоследний - на последний. а там уже есть есть все кроме последнего и предпоследнего
    # второй домножим на все кроме второго и первого, а первый там уже был
    # первый, в котором единица - домножим на все, кроме первого
    accum = 1
    for i in range(len(nums) - 1, -1, -1):
        res[i] *= accum
        accum *= nums[i]

    return res

print(productExceptSelf([1, 2, 3, 4]))