class Solution:
    def isPowerOfFour(self, n: int) -> bool:
        if n < 0:
            return False

        # сначала проверяем, является ли число степенью двойки
        # степень двойки бинарно - это одна 1 и все остальные нули.
        # получается, что побитовый и 1000 и 0111 должен вернуть ноль
        if n & (n - 1) != 0:
            return False

        # у сепени четвёрки 1 должна быть на нечётном месте
        # можно просто посчитать количество нулей перед единицей счётчиком и битовым сдвигом вправо. количество нудей должно быть чётным
        # а можно взять маску. в 16тиричном представлении это 55555555
        # я взял максимум, те print('{2 **23 - 1:b}') и поменял чэтные единицы на нули
        # можно циклом и сдвигом...
        return n & 0b1010101010101010101010101010101
