class Solution:
    def poorPigs(self, buckets: int, minutesToDie: int, minutesToTest: int) -> int:
        states = minutesToTest // minutesToDie + 1
        pigs = 0

        while states ** pigs < buckets:
            pigs += 1

        return pigs

'''
две свиньи два испытания 9 вёдер
ведро 1 испытание 1 свинья 1
ведро 2 испытание 1 свинья 2
ведро 3 испытание 2 свинья 1
ведро 4 испытание 2 свинья 2
ведро 5 испытание 1 всиньи 1, 2
ведро 6 испытание 2 свиньи 1, 2
ведро 7 испытание 1 свинья 1, испытание 2 свинья 2
ведро 8 испытание 2 свинья 1, испытание 1 свинья 2

испытание1:
свинья 1 - вёдра 1, 5, 7
свинья 2 - вёдра 2, 5, 8

испытание2:
свинья 1 - вёдра 3, 6, 8
свинья 2 - вёдра 4, 6, 7

одно испытание 8 вёдер - нужно три свиньи
ведро 0 -> 0 0 0
ведро 1 -> 0 0 1 - умрёт только первая свинья
      2 -> 0 1 0
      ...
      5 -> 1 0 1 - умрёт первая и третья свиньи
      6 -> 1 1 0
      7 -> 1 1 1

два испытания 27 вёдер - нужно три свиньи
0 -> 0 0 0
1 -> 0 0 1
2 -> 0 0 2
3 -> 0 1 0
4 -> 0 1 1
5 -> 0 1 2 - первая свинья умрёт на втором испытании, вторая на первом
...
26 -> 2 2 2 = 3 ** 3 - 1

'''
